Revit 2026 API

# PlumbingUtilsConvertPipePlaceholders Method

---
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ICollection<ElementId> ConvertPipePlaceholders(
	Document document,
	ICollection<ElementId> placeholderIds
)
```
```vb
Public Shared Function ConvertPipePlaceholders (
	document As Document,
	placeholderIds As ICollection(Of ElementId)
) As ICollection(Of ElementId)
```
```cpp
public:
static ICollection<ElementId^>^ ConvertPipePlaceholders(
	Document^ document,
	ICollection<ElementId^>^ placeholderIds
)
```
```fsharp
static member ConvertPipePlaceholders :
        document : Document *
        placeholderIds : ICollection<ElementId> -> ICollection<ElementId>
```

#### Parameters

document Document

placeholderIds ICollectionElementId

#### Return Value

ICollectionElementId

#### Reference

PlumbingUtils Class

Autodesk.Revit.DB.Plumbing Namespace